## Staging: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 3 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                   NAME                                   |
|--------|--------------------------------------------------------------------------|
| add    | `aws_iam_instance_profile.karpenter`                                     |
|        | `aws_iam_role_policy.karpenter_controller`                               |
|        | `aws_iam_role_policy_attachment.karpenter-cluster-cni`                   |
|        | `aws_iam_role_policy_attachment.karpenter-cluster-ecr`                   |
|        | `aws_iam_role_policy_attachment.karpenter-cluster-managed-instance-core` |
|        | `aws_iam_role_policy_attachment.karpenter-cluster-worker-node`           |
|        | `aws_iam_role_policy_attachment.karpenter_ssm_policy`                    |
|        | `module.iam_assumable_role_karpenter.aws_iam_role.this[0]`               |
| update | `aws_eks_node_group.notification-canada-ca-eks-node-group`               |
|        | `aws_iam_role.eks-cluster-role`                                          |
|        | `aws_security_group.notification-canada-ca-worker`                       |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_eks_node_group.notification-canada-ca-eks-node-group will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group" {
        id              = "notification-canada-ca-staging-eks-cluster:notification-canada-ca-staging-eks-primary-node-group"
      ~ tags            = {
          + "karpenter.sh/discovery" = "notification-canada-ca-staging-eks-cluster"
            # (2 unchanged elements hidden)
        }
      ~ tags_all        = {
          + "karpenter.sh/discovery" = "notification-canada-ca-staging-eks-cluster"
            # (2 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_iam_instance_profile.karpenter will be created
  + resource "aws_iam_instance_profile" "karpenter" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "KarpenterNodeInstanceProfile-notification-canada-ca-staging-eks-cluster"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "eks-worker-role"
      + tags_all    = (known after apply)
      + unique_id   = (known after apply)
    }

  # aws_iam_role.eks-cluster-role will be updated in-place
  ~ resource "aws_iam_role" "eks-cluster-role" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "sts:AssumeRole"
                        Effect    = "Allow"
                        Principal = {
                            Service = "eks.amazonaws.com"
                        }
                    },
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        id                    = "eks-cluster-role"
        name                  = "eks-cluster-role"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy.karpenter_controller will be created
  + resource "aws_iam_role_policy" "karpenter_controller" {
      + id     = (known after apply)
      + name   = "karpenter-policy-notification-canada-ca-staging-eks-cluster"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "iam:PassRole",
                          + "ec2:DescribeImages",
                          + "ec2:RunInstances",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeInstanceTypeOfferings",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DeleteLaunchTemplate",
                          + "ec2:CreateTags",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                          + "ec2:TerminateInstances",
                          + "ec2:DescribeSpotPriceHistory",
                          + "pricing:GetProducts",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "karpenter-controller-notification-canada-ca-staging-eks-cluster"
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-cni will be created
  + resource "aws_iam_role_policy_attachment" "karpenter-cluster-cni" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "karpenter-controller-notification-canada-ca-staging-eks-cluster"
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-ecr will be created
  + resource "aws_iam_role_policy_attachment" "karpenter-cluster-ecr" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "karpenter-controller-notification-canada-ca-staging-eks-cluster"
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-managed-instance-core will be created
  + resource "aws_iam_role_policy_attachment" "karpenter-cluster-managed-instance-core" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "karpenter-controller-notification-canada-ca-staging-eks-cluster"
    }

  # aws_iam_role_policy_attachment.karpenter-cluster-worker-node will be created
  + resource "aws_iam_role_policy_attachment" "karpenter-cluster-worker-node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "karpenter-controller-notification-canada-ca-staging-eks-cluster"
    }

  # aws_iam_role_policy_attachment.karpenter_ssm_policy will be created
  + resource "aws_iam_role_policy_attachment" "karpenter_ssm_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "eks-worker-role"
    }

  # aws_security_group.notification-canada-ca-worker will be updated in-place
  ~ resource "aws_security_group" "notification-canada-ca-worker" {
        id                     = "sg-0fcd9ca1bc66e469c"
        name                   = "notification-canada-ca-worker"
      ~ tags                   = {
          + "karpenter.sh/discovery" = "notification-canada-ca-staging-eks-cluster"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          + "karpenter.sh/discovery" = "notification-canada-ca-staging-eks-cluster"
            # (1 unchanged element hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.iam_assumable_role_karpenter.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C:sub = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::239043911459:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/8E890C7C4012094A93B6FDD00681B54C"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "karpenter-controller-notification-canada-ca-staging-eks-cluster"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 8 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + eks_cluster_endpoint       = "https://8E890C7C4012094A93B6FDD00681B54C.sk1.ca-central-1.eks.amazonaws.com"
  + karpenter_iam_role_arn     = (known after apply)
  + karpenter_instance_profile = "KarpenterNodeInstanceProfile-notification-canada-ca-staging-eks-cluster"

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
